Revit 2027 API
Ellipse.XDirection Property
The X direction.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ XDirection { get; }
Public ReadOnly Property XDirection As XYZ
	Get
public:
property XYZ^ XDirection {
	XYZ^ get ();
}
member XDirection : XYZ with get
Property Value
XYZ
See Also
Reference
Ellipse Class
Autodesk.Revit.DB Namespace